org/scala/dotty/en/generic-type-class-derivation.org
#+title: Generic Type Class Derivation in Scala 3
#+author: Jichao Ouyang
#+date: <2021-08-14 Sat>
#+description: Let's try something more practical this time: redesigning a Category Theory library for Scala 3.
#+keywords: typeclasses,type classes,scala 3,dotty,meow,cats
#+HTML_HEAD_EXTRA: <meta property="og:title" content="Generic Type Class Derivation in Scala 3" />
#+HTML_HEAD_EXTRA: <meta property="og:description" content="Let's try something more practical this time: redesigning a Category Theory library for Scala 3." />
#+HTML_HEAD_EXTRA: <meta property="og:type" content="article" />
#+HTML_HEAD_EXTRA: <meta content="https://blog.oyanglul.us/images/dotty-logo.png" property="og:image">
#+index: Scala!Generic Type Class Derivation in Scala 3
#+index: Dotty!Generic Type Class Derivation in Scala 3
#+index: FP!Generic Type Class Derivation in Scala 3

#+INCLUDE: !toc.org

From the previous article [[./type-classes.org][Type Classes]], we know that it should be very straightforward to implement a =Functor= instance, e.g. for =Option=.

#+begin_src scala
given Functor[Option] with
  def fmap[A, B](f: A => B): Option[A] => Option[B] = (oa: Option[A]) => oa match
    case Some(a) => Some(f(a))
    case None => None
#+end_src

However, there are so many data types to implement, and there is too much boilerplate for each new data type, although it is easy to do so.

Let's say we have a new ADT =Tree=:
#+begin_src scala
  enum Tree[T] {
    case Branch(left: Tree[T], right: Tree[T])
    case Leaf(elem: T)
  }
#+end_src

If we want this =Tree= to be =map=-able, =show=-able, we need to implement =Functor= and =Show= instance for =Tree=.

Since =Tree= is an ADT, which means it can be represented as a generic type =Product= or =Coproduct=, this is where shapeless come in handy in Scala 2,
and with some shapeless-based libs like  [[https://github.com/typelevel/kittens][Kittens]], we can just simply derive these type class instances without actually implementing them.

Example in Kittens[fn:3]:
#+begin_src scala
import cats.derived._
implicit val showTree: Show[Tree] = semiauto.show
implicit val functorTree: Functor[Tree] = semiauto.functor
#+end_src

In Scala 3, something like this is natively supported, it can be done without any lib.

Let's start with the simpler type class =Show=.

* Kind 0 Type Class Derivation
  =Show= is type class for =A=, since =A= is just a type, let us call =A= Kind 0 and =A[_]= Kind 1.
  To create a generic type class derivation natively in Scala 3, the steps are pretty similar to shapeless:
  
  1. Find generic representation of type =A=, that is, break =A= into =Product= and =Coproduct= combinations
  2. Implement instances for =Product= and =Coproduct= types.

  For the impatient, the final result of generic =Show= derivation in Scala 3 will look like:
  #+begin_src scala
    enum Tree[T] derives Show {
      case Branch(left: Tree[T], right: Tree[T])
      case Leaf(elem: T)
    }

  #+end_src
  Yeah, it is that simple, just add =derives Show= to the data type.

