org/scala/dotty/en/generic-type-class-derivation.org
** Generic representation of =A=
   Scala 3 is able to derive the generic representation of data types as =Mirror[T]= type[fn:1], in the same way shapeless' =Generic[T]= type did.

   In our example, to derive the generic representation of =Tree=, we can simply define a =derived= function:
   #+begin_src scala
     inline def derived[T](using m: Mirror.Of[T]): Show[T] =
       inline m match
         case s: Mirror.SumOf[T] => ???
         case p: Mirror.ProductOf[T] => ???
   #+end_src

   By =using m: Mirror.Of[T]=, the compiler will automatically derive the =Mirror.Of[T]= type from =T=, which will look like:
   #+begin_src scala
     new Mirror.Sum:
       type MirroredType = Tree
       type MirroredElemTypes[T] = (Branch[T], Leaf[T])
       type MirroredMonoType = Tree[_]
       type MirroredLabel = "Tree"
       type MirroredElemLabels = ("Branch", "Leaf")

       def ordinal(x: MirroredMonoType): Int = x match
         case _: Branch[_] => 0
         case _: Leaf[_] => 1

     new Mirror.Product:
       type MirroredType = Branch
       type MirroredElemTypes[T] = (Tree[T], Tree[T])
       type MirroredMonoType = Branch[_]
       type MirroredLabel = "Branch"
       type MirroredElemLabels = ("left", "right")

       def fromProduct(p: Product): MirroredMonoType =
         new Branch(...)

     new Mirror.Product:
       type MirroredType = Leaf
       type MirroredElemTypes[T] = Tuple1[T]
       type MirroredMonoType = Leaf[_]
       type MirroredLabel = "Leaf"
       type MirroredElemLabels = Tuple1["elem"]

       def fromProduct(p: Product): MirroredMonoType =
         new Leaf(...)
   #+end_src
   You don't have to memorize them all, we will get to each of these types shortly.

   Since =Tree= is a =Coproduct= (=Sum=) type, we first need to figure out if it is a =Branch= or a =Leaf= to correctly represent the =Tree= data type.

   Hence, the process to properly show =Tree=:
   
   1. compiler derives =Mirror.Of[Tree]=, the result is a =Mirror.Sum=
   2. break into =Mirror.Sum=, if type is =Mirror.ProductOf[Branch]=, recursively show its =left= and =right=
   3. if type is =Mirror.ProductOf[Leaf]=, recursively show its =elem=

   Let's start with the simplest type, if our data type is a =Leaf=, how do we show it?

