scala/dotty/en/generic-type-class-derivation.html

<div id="outline-container-org0cace50" class="outline-3">
<h3 id="org0cace50">Generic representation of <code>A</code></h3>
<div class="outline-text-3" id="text-org0cace50">
<p>
Scala 3 is able to derive the generic representation of data types as <code>Mirror[T]</code> type<label for="2" class="margin-toggle sidenote-number"></label><input type="checkbox" id="2" class="margin-toggle"/><span class="sidenote">
<a href="https://dotty.epfl.ch/docs/reference/contextual/derivation.html#types-supporting-derives-clauses">https://dotty.epfl.ch/docs/reference/contextual/derivation.html#types-supporting-derives-clauses</a> 
</span>, in the same way shapeless' <code>Generic[T]</code> type did.
</p>

<p>
In our example, to derive the generic representation of <code>Tree</code>, we can simply define a <code>derived</code> function:
</p>
<pre class="code"><code><span style="color: #81A1C1;">inline</span> <span style="color: #81A1C1;">def</span> <span style="font-weight: bold;">derived</span>[<span style="color: #81A1C1;">T</span>](<span style="color: #81A1C1;">using</span> m<span style="color: #81A1C1;">:</span> <span style="color: #81A1C1;">Mirror</span>.<span style="color: #81A1C1;">Of</span>[<span style="color: #81A1C1;">T</span>])<span style="color: #81A1C1;">:</span> <span style="color: #81A1C1;">Show</span>[<span style="color: #81A1C1;">T</span>] <span style="color: #81A1C1;">=</span>
  <span style="color: #81A1C1;">inline</span> m <span style="color: #81A1C1;">match</span>
    <span style="color: #81A1C1;">case</span> <span style="font-weight: bold;">s</span><span style="color: #81A1C1;">:</span> <span style="color: #81A1C1;">Mirror</span>.<span style="color: #81A1C1;">SumOf</span>[<span style="color: #81A1C1;">T</span>] <span style="color: #81A1C1;">=&gt;</span> ???
    <span style="color: #81A1C1;">case</span> <span style="font-weight: bold;">p</span><span style="color: #81A1C1;">:</span> <span style="color: #81A1C1;">Mirror</span>.<span style="color: #81A1C1;">ProductOf</span>[<span style="color: #81A1C1;">T</span>] <span style="color: #81A1C1;">=&gt;</span> ???
</code></pre>

<p>
By <code>using m: Mirror.Of[T]</code>, the compiler will automatically derive the <code>Mirror.Of[T]</code> type from <code>T</code>, which will look like:
</p>
<pre class="code"><code><span style="color: #81A1C1;">new</span> <span style="color: #81A1C1;">Mirror</span>.<span style="color: #81A1C1;">Sum</span><span style="color: #81A1C1;">:</span>
  <span style="color: #81A1C1;">type</span> <span style="color: #81A1C1;">MirroredType</span> <span style="color: #81A1C1;">=</span> <span style="color: #81A1C1;">Tree</span>
  <span style="color: #81A1C1;">type</span> <span style="color: #81A1C1;">MirroredElemTypes</span>[<span style="color: #81A1C1;">T</span>] <span style="color: #81A1C1;">=</span> (<span style="color: #81A1C1;">Branch</span>[<span style="color: #81A1C1;">T</span>], <span style="color: #81A1C1;">Leaf</span>[<span style="color: #81A1C1;">T</span>])
  <span style="color: #81A1C1;">type</span> <span style="color: #81A1C1;">MirroredMonoType</span> <span style="color: #81A1C1;">=</span> <span style="color: #81A1C1;">Tree</span>[<span style="color: #81A1C1;">_</span>]
  <span style="color: #81A1C1;">type</span> <span style="color: #81A1C1;">MirroredLabel</span> <span style="color: #81A1C1;">=</span> <span style="color: #D08770;">"Tree"</span>
  <span style="color: #81A1C1;">type</span> <span style="color: #81A1C1;">MirroredElemLabels</span> <span style="color: #81A1C1;">=</span> (<span style="color: #D08770;">"Branch"</span>, <span style="color: #D08770;">"Leaf"</span>)

  <span style="color: #81A1C1;">def</span> <span style="font-weight: bold;">ordinal</span>(x<span style="color: #81A1C1;">:</span> <span style="color: #81A1C1;">MirroredMonoType</span>)<span style="color: #81A1C1;">:</span> <span style="color: #81A1C1;">Int</span> <span style="color: #81A1C1;">=</span> x <span style="color: #81A1C1;">match</span>
    <span style="color: #81A1C1;">case</span> <span style="color: #81A1C1;">_:</span> <span style="color: #81A1C1;">Branch</span>[<span style="color: #81A1C1;">_</span>] <span style="color: #81A1C1;">=&gt;</span> <span style="color: #81A1C1;">0</span>
    <span style="color: #81A1C1;">case</span> <span style="color: #81A1C1;">_:</span> <span style="color: #81A1C1;">Leaf</span>[<span style="color: #81A1C1;">_</span>] <span style="color: #81A1C1;">=&gt;</span> <span style="color: #81A1C1;">1</span>

<span style="color: #81A1C1;">new</span> <span style="color: #81A1C1;">Mirror</span>.<span style="color: #81A1C1;">Product</span><span style="color: #81A1C1;">:</span>
  <span style="color: #81A1C1;">type</span> <span style="color: #81A1C1;">MirroredType</span> <span style="color: #81A1C1;">=</span> <span style="color: #81A1C1;">Branch</span>
  <span style="color: #81A1C1;">type</span> <span style="color: #81A1C1;">MirroredElemTypes</span>[<span style="color: #81A1C1;">T</span>] <span style="color: #81A1C1;">=</span> (<span style="color: #81A1C1;">Tree</span>[<span style="color: #81A1C1;">T</span>], <span style="color: #81A1C1;">Tree</span>[<span style="color: #81A1C1;">T</span>])
  <span style="color: #81A1C1;">type</span> <span style="color: #81A1C1;">MirroredMonoType</span> <span style="color: #81A1C1;">=</span> <span style="color: #81A1C1;">Branch</span>[<span style="color: #81A1C1;">_</span>]
  <span style="color: #81A1C1;">type</span> <span style="color: #81A1C1;">MirroredLabel</span> <span style="color: #81A1C1;">=</span> <span style="color: #D08770;">"Branch"</span>
  <span style="color: #81A1C1;">type</span> <span style="color: #81A1C1;">MirroredElemLabels</span> <span style="color: #81A1C1;">=</span> (<span style="color: #D08770;">"left"</span>, <span style="color: #D08770;">"right"</span>)

  <span style="color: #81A1C1;">def</span> <span style="font-weight: bold;">fromProduct</span>(p<span style="color: #81A1C1;">:</span> <span style="color: #81A1C1;">Product</span>)<span style="color: #81A1C1;">:</span> <span style="color: #81A1C1;">MirroredMonoType</span> <span style="color: #81A1C1;">=</span>
    <span style="color: #81A1C1;">new</span> <span style="color: #81A1C1;">Branch</span>(...)

<span style="color: #81A1C1;">new</span> <span style="color: #81A1C1;">Mirror</span>.<span style="color: #81A1C1;">Product</span><span style="color: #81A1C1;">:</span>
  <span style="color: #81A1C1;">type</span> <span style="color: #81A1C1;">MirroredType</span> <span style="color: #81A1C1;">=</span> <span style="color: #81A1C1;">Leaf</span>
  <span style="color: #81A1C1;">type</span> <span style="color: #81A1C1;">MirroredElemTypes</span>[<span style="color: #81A1C1;">T</span>] <span style="color: #81A1C1;">=</span> <span style="color: #81A1C1;">Tuple1</span>[<span style="color: #81A1C1;">T</span>]
  <span style="color: #81A1C1;">type</span> <span style="color: #81A1C1;">MirroredMonoType</span> <span style="color: #81A1C1;">=</span> <span style="color: #81A1C1;">Leaf</span>[<span style="color: #81A1C1;">_</span>]
  <span style="color: #81A1C1;">type</span> <span style="color: #81A1C1;">MirroredLabel</span> <span style="color: #81A1C1;">=</span> <span style="color: #D08770;">"Leaf"</span>
  <span style="color: #81A1C1;">type</span> <span style="color: #81A1C1;">MirroredElemLabels</span> <span style="color: #81A1C1;">=</span> <span style="color: #81A1C1;">Tuple1</span>[<span style="color: #D08770;">"elem"</span>]

  <span style="color: #81A1C1;">def</span> <span style="font-weight: bold;">fromProduct</span>(p<span style="color: #81A1C1;">:</span> <span style="color: #81A1C1;">Product</span>)<span style="color: #81A1C1;">:</span> <span style="color: #81A1C1;">MirroredMonoType</span> <span style="color: #81A1C1;">=</span>
    <span style="color: #81A1C1;">new</span> <span style="color: #81A1C1;">Leaf</span>(...)
</code></pre>
<p>
You don't have to memorize them all, we will get to each of these types shortly.
</p>

<p>
Since <code>Tree</code> is a <code>Coproduct</code> (<code>Sum</code>) type, we first need to figure out if it is a <code>Branch</code> or a <code>Leaf</code> to correctly represent the <code>Tree</code> data type.
</p>

<p>
Hence, the process to properly show <code>Tree</code>:
</p>

<ol class="org-ol">
<li>compiler derives <code>Mirror.Of[Tree]</code>, the result is a <code>Mirror.Sum</code></li>
<li>break into <code>Mirror.Sum</code>, if type is <code>Mirror.ProductOf[Branch]</code>, recursively show its <code>left</code> and <code>right</code></li>
<li>if type is <code>Mirror.ProductOf[Leaf]</code>, recursively show its <code>elem</code></li>
</ol>

<p>
Let's start with the simplest type, if our data type is a <code>Leaf</code>, how do we show it?
</p>
</div>
</div>
