org/scala/dotty/en/generic-type-class-derivation.org
** Generic instance of  =Show[Product]= type

   There is a singleton type ~MirroredLabel = "Leaf"~ we can use to show, and for whose =elem=, we can recursively derive =Show= instances for =MirroredElemTypes=
   #+begin_src scala
     inline def summonAsList[T <: Tuple, F[_]]: List[F[Any]] =
       inline erasedValue[T] match
         case _: EmptyTuple => Nil
         case _: (t *: ts) => summonInline[F[t]].asInstanceOf[F[Any]] :: summonAsList[ts, F]

     inline def derived[T](using m: Mirror.Of[T]): Show[T] =
       lazy val name = constValue[m.MirroredLabel]
       lazy val elemsShowInstances = summonAsList[m.MirroredElemTypes, Show]
       inline m match
         case s: Mirror.SumOf[T] => ???
         case p: Mirror.ProductOf[T] => ???
   #+end_src

   - =constValue[m.MirroredLabel]= will get the singleton type's value, which is =Leaf=
   - =summonAsList= recursively find =Show= instance for each of =Leaf='s elements

   Now we know the =name= of current type =Leaf=, and =elemsShowInstances= of =Leaf='s elements, let's try to fill the =???= with the actual implementation of =Show[Product]=
   #+begin_src scala
      inline def derived[T](using m: Mirror.Of[T]): Show[T] =
        lazy val name = constValue[m.MirroredLabel]
        lazy val elemsShowInstances = summonAsList[m.MirroredElemTypes, Show]
        inline m match
          case s: Mirror.SumOf[T] => ???
          case p: Mirror.ProductOf[T] => new Show[T]:          // <- (ref:ProductOf)
            def show(a: T): String =
              val elems = elemsShowInstances.iterator
                .zip(a.asInstanceOf[Product].prodIterator)     // <- (ref:asInstanceOf)
                .map { _.show(_) }
              s"${name}(${elems.mkString(", ")})"
   #+end_src
   [[(asInstanceOf)][=a.asInstanceOf[Product]=]] looks really dangerous, but it's actually safe here, because we know that
   =T= is definitely a =Product=, so =p= must be a [[(ProductOf)][=Mirror.ProductOf[T]=]].

   The implementation should be capable to derive =Show= for any type that has a =Mirror.Product= instance. Let's give it a try:
   #+begin_src scala
     assertEquals(show(Leaf("leaf")), """Leaf("leaf")""")
   #+end_src


   But that doesn't work yet, because even we know how to show =Product= but, =Leaf= is one of the =Tree= =Coproduct= type.

   =Coproduct= type has one more concept =ordinal=, if you have pay attention in the =Mirror.Sum= instance of =Tree=:
   #+begin_src scala
     new Mirror.Sum:
       type MirroredType = Tree
       type MirroredElemTypes[T] = (Branch[T], Leaf[T])
       type MirroredMonoType = Tree[_]
       type MirroredLabel = "Tree"
       type MirroredElemLabels = ("Branch", "Leaf")

       def ordinal(x: MirroredMonoType): Int = x match
         case _: Branch[_] => 0
         case _: Leaf[_] => 1
   #+end_src

   That is, when =Tree= is constructed from =Branch=, the ordinal is 0, and the ordinal of =Leaf='s is 1.

   By simply checking the [[(Ordinal)][ordinal]] of =T=, we can show =T= properly:
   #+begin_src scala
     inline def derived[T](using m: Mirror.Of[T]): Show[T] =
       lazy val name = constValue[m.MirroredLabel]
       lazy val elemsShowInstances = summonAsList[m.MirroredElemTypes, Show]
       inline m match
         case s: Mirror.SumOf[T] => new Show[T]:
           def show(a: T): String =
             val ord = s.ordinal(a)   // <- (ref:Ordinal)
             s"${insts(ord).asInstanceOf[Show[T]].show(a)}: ${name}"
         case p: Mirror.ProductOf[T] => new Show[T]:          
           def show(a: T): String =
             val elems = elemsShowInstances.iterator
               .zip(a.asInstanceOf[Product].prodIterator)
               .map { _.show(_) }
             s"${name}(${elems.mkString(", ")})"
   #+end_src

   Finally, let's verify that works as expected:
   #+begin_src scala
    val aTree: Tree[String] = Branch(Leaf("l0"), Branch(Leaf("l1"), Leaf("r1")))
    assertEquals(show(aTree), """Branch(Leaf("l0"): Tree, Branch(Leaf("l1"): Tree, Leaf("r1"): Tree): Tree): Tree""")
   #+end_src
