scala/dotty/en/generic-type-class-derivation.html

<div id="outline-container-org1b1ec6a" class="outline-3">
<h3 id="org1b1ec6a">Generic instance of  <code>Show[Product]</code> type</h3>
<div class="outline-text-3" id="text-org1b1ec6a">
<p>
There is a singleton type <code>MirroredLabel = "Leaf"</code> we can use to show, and for whose <code>elem</code>, we can recursively derive <code>Show</code> instances for <code>MirroredElemTypes</code>
</p>
<pre class="code"><code><span style="color: #81A1C1;">inline</span> <span style="color: #81A1C1;">def</span> <span style="font-weight: bold;">summonAsList</span>[<span style="color: #81A1C1;">T</span> <span style="color: #81A1C1;">&lt;:</span> <span style="color: #81A1C1;">Tuple</span>, <span style="color: #81A1C1;">F</span>[<span style="color: #81A1C1;">_</span>]]<span style="color: #81A1C1;">:</span> <span style="color: #81A1C1;">List</span>[<span style="color: #81A1C1;">F</span>[<span style="color: #81A1C1;">Any</span>]] <span style="color: #81A1C1;">=</span>
  <span style="color: #81A1C1;">inline</span> erasedValue[<span style="color: #81A1C1;">T</span>] <span style="color: #81A1C1;">match</span>
    <span style="color: #81A1C1;">case</span> <span style="color: #81A1C1;">_:</span> <span style="color: #81A1C1;">EmptyTuple</span> <span style="color: #81A1C1;">=&gt;</span> <span style="color: #81A1C1;">Nil</span>
    <span style="color: #81A1C1;">case</span> <span style="color: #81A1C1;">_:</span> (t *: ts) <span style="color: #81A1C1;">=&gt;</span> summonInline[<span style="color: #81A1C1;">F</span>[t]].asInstanceOf[<span style="color: #81A1C1;">F</span>[<span style="color: #81A1C1;">Any</span>]] :: summonAsList[ts, <span style="color: #81A1C1;">F</span>]

<span style="color: #81A1C1;">inline</span> <span style="color: #81A1C1;">def</span> <span style="font-weight: bold;">derived</span>[<span style="color: #81A1C1;">T</span>](<span style="color: #81A1C1;">using</span> m<span style="color: #81A1C1;">:</span> <span style="color: #81A1C1;">Mirror</span>.<span style="color: #81A1C1;">Of</span>[<span style="color: #81A1C1;">T</span>])<span style="color: #81A1C1;">:</span> <span style="color: #81A1C1;">Show</span>[<span style="color: #81A1C1;">T</span>] <span style="color: #81A1C1;">=</span>
  <span style="color: #81A1C1;">lazy</span> <span style="color: #81A1C1;">val</span> <span style="font-weight: bold;">name</span> <span style="color: #81A1C1;">=</span> constValue[m.<span style="color: #81A1C1;">MirroredLabel</span>]
  <span style="color: #81A1C1;">lazy</span> <span style="color: #81A1C1;">val</span> <span style="font-weight: bold;">elemsShowInstances</span> <span style="color: #81A1C1;">=</span> summonAsList[m.<span style="color: #81A1C1;">MirroredElemTypes</span>, <span style="color: #81A1C1;">Show</span>]
  <span style="color: #81A1C1;">inline</span> m <span style="color: #81A1C1;">match</span>
    <span style="color: #81A1C1;">case</span> <span style="font-weight: bold;">s</span><span style="color: #81A1C1;">:</span> <span style="color: #81A1C1;">Mirror</span>.<span style="color: #81A1C1;">SumOf</span>[<span style="color: #81A1C1;">T</span>] <span style="color: #81A1C1;">=&gt;</span> ???
    <span style="color: #81A1C1;">case</span> <span style="font-weight: bold;">p</span><span style="color: #81A1C1;">:</span> <span style="color: #81A1C1;">Mirror</span>.<span style="color: #81A1C1;">ProductOf</span>[<span style="color: #81A1C1;">T</span>] <span style="color: #81A1C1;">=&gt;</span> ???
</code></pre>

<ul class="org-ul">
<li><code>constValue[m.MirroredLabel]</code> will get the singleton type's value, which is <code>Leaf</code></li>
<li><code>summonAsList</code> recursively find <code>Show</code> instance for each of <code>Leaf</code>'s elements</li>
</ul>

<p>
Now we know the <code>name</code> of current type <code>Leaf</code>, and <code>elemsShowInstances</code> of <code>Leaf</code>'s elements, let's try to fill the <code>???</code> with the actual implementation of <code>Show[Product]</code>
</p>
<pre class="code"><code><span style="color: #81A1C1;">inline</span> <span style="color: #81A1C1;">def</span> <span style="font-weight: bold;">derived</span>[<span style="color: #81A1C1;">T</span>](<span style="color: #81A1C1;">using</span> m<span style="color: #81A1C1;">:</span> <span style="color: #81A1C1;">Mirror</span>.<span style="color: #81A1C1;">Of</span>[<span style="color: #81A1C1;">T</span>])<span style="color: #81A1C1;">:</span> <span style="color: #81A1C1;">Show</span>[<span style="color: #81A1C1;">T</span>] <span style="color: #81A1C1;">=</span>
  <span style="color: #81A1C1;">lazy</span> <span style="color: #81A1C1;">val</span> <span style="font-weight: bold;">name</span> <span style="color: #81A1C1;">=</span> constValue[m.<span style="color: #81A1C1;">MirroredLabel</span>]
  <span style="color: #81A1C1;">lazy</span> <span style="color: #81A1C1;">val</span> <span style="font-weight: bold;">elemsShowInstances</span> <span style="color: #81A1C1;">=</span> summonAsList[m.<span style="color: #81A1C1;">MirroredElemTypes</span>, <span style="color: #81A1C1;">Show</span>]
  <span style="color: #81A1C1;">inline</span> m <span style="color: #81A1C1;">match</span>
    <span style="color: #81A1C1;">case</span> <span style="font-weight: bold;">s</span><span style="color: #81A1C1;">:</span> <span style="color: #81A1C1;">Mirror</span>.<span style="color: #81A1C1;">SumOf</span>[<span style="color: #81A1C1;">T</span>] <span style="color: #81A1C1;">=&gt;</span> ???
<span id="coderef-ProductOf" class="coderef-off">    <span style="color: #81A1C1;">case</span> <span style="font-weight: bold;">p</span><span style="color: #81A1C1;">:</span> <span style="color: #81A1C1;">Mirror</span>.<span style="color: #81A1C1;">ProductOf</span>[<span style="color: #81A1C1;">T</span>] <span style="color: #81A1C1;">=&gt;</span> <span style="color: #81A1C1;">new</span> <span style="color: #81A1C1;">Show</span>[<span style="color: #81A1C1;">T</span>]<span style="color: #81A1C1;">:</span>          <span style="color: #677691;">// </span><span style="color: #677691;">&lt;-</span> (ProductOf)</span>
      <span style="color: #81A1C1;">def</span> <span style="font-weight: bold;">show</span>(a<span style="color: #81A1C1;">:</span> <span style="color: #81A1C1;">T</span>)<span style="color: #81A1C1;">:</span> <span style="color: #81A1C1;">String</span> <span style="color: #81A1C1;">=</span>
        <span style="color: #81A1C1;">val</span> <span style="font-weight: bold;">elems</span> <span style="color: #81A1C1;">=</span> elemsShowInstances.iterator
<span id="coderef-asInstanceOf" class="coderef-off">          .zip(a.asInstanceOf[<span style="color: #81A1C1;">Product</span>].prodIterator)     <span style="color: #677691;">// </span><span style="color: #677691;">&lt;-</span> (asInstanceOf)</span>
          .map { <span style="color: #81A1C1;">_</span>.show(<span style="color: #81A1C1;">_</span>) }
        s<span style="color: #D08770;">"</span><span style="font-weight: bold;">${name}</span><span style="color: #D08770;">(${elems.mkString("</span>, <span style="color: #D08770;">")})"</span>
</code></pre>
<p>
<a href="#coderef-asInstanceOf" class="coderef" onmouseover="CodeHighlightOn(this, 'coderef-asInstanceOf');" onmouseout="CodeHighlightOff(this, 'coderef-asInstanceOf');"><code>a.asInstanceOf[Product]</code></a> looks really dangerous, but it's actually safe here, because we know that
<code>T</code> is definitely a <code>Product</code>, so <code>p</code> must be a <a href="#coderef-ProductOf" class="coderef" onmouseover="CodeHighlightOn(this, 'coderef-ProductOf');" onmouseout="CodeHighlightOff(this, 'coderef-ProductOf');"><code>Mirror.ProductOf[T]</code></a>.
</p>

<p>
The implementation should be capable to derive <code>Show</code> for any type that has a <code>Mirror.Product</code> instance. Let's give it a try:
</p>
<pre class="code"><code>assertEquals(show(<span style="color: #81A1C1;">Leaf</span>(<span style="color: #D08770;">"leaf"</span>)), <span style="color: #D08770;">"""Leaf("leaf")"""</span>)
</code></pre>


<p>
But that doesn't work yet, because even we know how to show <code>Product</code> but, <code>Leaf</code> is one of the <code>Tree</code> <code>Coproduct</code> type.
</p>

<p>
<code>Coproduct</code> type has one more concept <code>ordinal</code>, if you have pay attention in the <code>Mirror.Sum</code> instance of <code>Tree</code>:
</p>
<pre class="code"><code><span style="color: #81A1C1;">new</span> <span style="color: #81A1C1;">Mirror</span>.<span style="color: #81A1C1;">Sum</span><span style="color: #81A1C1;">:</span>
  <span style="color: #81A1C1;">type</span> <span style="color: #81A1C1;">MirroredType</span> <span style="color: #81A1C1;">=</span> <span style="color: #81A1C1;">Tree</span>
  <span style="color: #81A1C1;">type</span> <span style="color: #81A1C1;">MirroredElemTypes</span>[<span style="color: #81A1C1;">T</span>] <span style="color: #81A1C1;">=</span> (<span style="color: #81A1C1;">Branch</span>[<span style="color: #81A1C1;">T</span>], <span style="color: #81A1C1;">Leaf</span>[<span style="color: #81A1C1;">T</span>])
  <span style="color: #81A1C1;">type</span> <span style="color: #81A1C1;">MirroredMonoType</span> <span style="color: #81A1C1;">=</span> <span style="color: #81A1C1;">Tree</span>[<span style="color: #81A1C1;">_</span>]
  <span style="color: #81A1C1;">type</span> <span style="color: #81A1C1;">MirroredLabel</span> <span style="color: #81A1C1;">=</span> <span style="color: #D08770;">"Tree"</span>
  <span style="color: #81A1C1;">type</span> <span style="color: #81A1C1;">MirroredElemLabels</span> <span style="color: #81A1C1;">=</span> (<span style="color: #D08770;">"Branch"</span>, <span style="color: #D08770;">"Leaf"</span>)

  <span style="color: #81A1C1;">def</span> <span style="font-weight: bold;">ordinal</span>(x<span style="color: #81A1C1;">:</span> <span style="color: #81A1C1;">MirroredMonoType</span>)<span style="color: #81A1C1;">:</span> <span style="color: #81A1C1;">Int</span> <span style="color: #81A1C1;">=</span> x <span style="color: #81A1C1;">match</span>
    <span style="color: #81A1C1;">case</span> <span style="color: #81A1C1;">_:</span> <span style="color: #81A1C1;">Branch</span>[<span style="color: #81A1C1;">_</span>] <span style="color: #81A1C1;">=&gt;</span> <span style="color: #81A1C1;">0</span>
    <span style="color: #81A1C1;">case</span> <span style="color: #81A1C1;">_:</span> <span style="color: #81A1C1;">Leaf</span>[<span style="color: #81A1C1;">_</span>] <span style="color: #81A1C1;">=&gt;</span> <span style="color: #81A1C1;">1</span>
</code></pre>

<p>
That is, when <code>Tree</code> is constructed from <code>Branch</code>, the ordinal is 0, and the ordinal of <code>Leaf</code>'s is 1.
</p>

<p>
By simply checking the <a href="#coderef-Ordinal" class="coderef" onmouseover="CodeHighlightOn(this, 'coderef-Ordinal');" onmouseout="CodeHighlightOff(this, 'coderef-Ordinal');">ordinal</a> of <code>T</code>, we can show <code>T</code> properly:
</p>
<pre class="code"><code><span style="color: #81A1C1;">inline</span> <span style="color: #81A1C1;">def</span> <span style="font-weight: bold;">derived</span>[<span style="color: #81A1C1;">T</span>](<span style="color: #81A1C1;">using</span> m<span style="color: #81A1C1;">:</span> <span style="color: #81A1C1;">Mirror</span>.<span style="color: #81A1C1;">Of</span>[<span style="color: #81A1C1;">T</span>])<span style="color: #81A1C1;">:</span> <span style="color: #81A1C1;">Show</span>[<span style="color: #81A1C1;">T</span>] <span style="color: #81A1C1;">=</span>
  <span style="color: #81A1C1;">lazy</span> <span style="color: #81A1C1;">val</span> <span style="font-weight: bold;">name</span> <span style="color: #81A1C1;">=</span> constValue[m.<span style="color: #81A1C1;">MirroredLabel</span>]
  <span style="color: #81A1C1;">lazy</span> <span style="color: #81A1C1;">val</span> <span style="font-weight: bold;">elemsShowInstances</span> <span style="color: #81A1C1;">=</span> summonAsList[m.<span style="color: #81A1C1;">MirroredElemTypes</span>, <span style="color: #81A1C1;">Show</span>]
  <span style="color: #81A1C1;">inline</span> m <span style="color: #81A1C1;">match</span>
    <span style="color: #81A1C1;">case</span> <span style="font-weight: bold;">s</span><span style="color: #81A1C1;">:</span> <span style="color: #81A1C1;">Mirror</span>.<span style="color: #81A1C1;">SumOf</span>[<span style="color: #81A1C1;">T</span>] <span style="color: #81A1C1;">=&gt;</span> <span style="color: #81A1C1;">new</span> <span style="color: #81A1C1;">Show</span>[<span style="color: #81A1C1;">T</span>]<span style="color: #81A1C1;">:</span>
      <span style="color: #81A1C1;">def</span> <span style="font-weight: bold;">show</span>(a<span style="color: #81A1C1;">:</span> <span style="color: #81A1C1;">T</span>)<span style="color: #81A1C1;">:</span> <span style="color: #81A1C1;">String</span> <span style="color: #81A1C1;">=</span>
<span id="coderef-Ordinal" class="coderef-off">        <span style="color: #81A1C1;">val</span> <span style="font-weight: bold;">ord</span> <span style="color: #81A1C1;">=</span> s.ordinal(a)   <span style="color: #677691;">// </span><span style="color: #677691;">&lt;-</span> (Ordinal)</span>
        s<span style="color: #D08770;">"</span><span style="font-weight: bold;">${insts(ord).asInstanceOf[Show[T]].show(a)}</span><span style="color: #D08770;">: </span><span style="font-weight: bold;">${name}</span><span style="color: #D08770;">"</span>
    <span style="color: #81A1C1;">case</span> <span style="font-weight: bold;">p</span><span style="color: #81A1C1;">:</span> <span style="color: #81A1C1;">Mirror</span>.<span style="color: #81A1C1;">ProductOf</span>[<span style="color: #81A1C1;">T</span>] <span style="color: #81A1C1;">=&gt;</span> <span style="color: #81A1C1;">new</span> <span style="color: #81A1C1;">Show</span>[<span style="color: #81A1C1;">T</span>]<span style="color: #81A1C1;">:</span>          
      <span style="color: #81A1C1;">def</span> <span style="font-weight: bold;">show</span>(a<span style="color: #81A1C1;">:</span> <span style="color: #81A1C1;">T</span>)<span style="color: #81A1C1;">:</span> <span style="color: #81A1C1;">String</span> <span style="color: #81A1C1;">=</span>
        <span style="color: #81A1C1;">val</span> <span style="font-weight: bold;">elems</span> <span style="color: #81A1C1;">=</span> elemsShowInstances.iterator
          .zip(a.asInstanceOf[<span style="color: #81A1C1;">Product</span>].prodIterator)
          .map { <span style="color: #81A1C1;">_</span>.show(<span style="color: #81A1C1;">_</span>) }
        s<span style="color: #D08770;">"</span><span style="font-weight: bold;">${name}</span><span style="color: #D08770;">(${elems.mkString("</span>, <span style="color: #D08770;">")})"</span>
</code></pre>

<p>
Finally, let's verify that works as expected:
</p>
<pre class="code"><code><span style="color: #81A1C1;">val</span> <span style="font-weight: bold;">aTree</span><span style="color: #81A1C1;">:</span> <span style="color: #81A1C1;">Tree</span>[<span style="color: #81A1C1;">String</span>] <span style="color: #81A1C1;">=</span> <span style="color: #81A1C1;">Branch</span>(<span style="color: #81A1C1;">Leaf</span>(<span style="color: #D08770;">"l0"</span>), <span style="color: #81A1C1;">Branch</span>(<span style="color: #81A1C1;">Leaf</span>(<span style="color: #D08770;">"l1"</span>), <span style="color: #81A1C1;">Leaf</span>(<span style="color: #D08770;">"r1"</span>)))
assertEquals(show(aTree), <span style="color: #D08770;">"""Branch(Leaf("l0"): Tree, Branch(Leaf("l1"): Tree, Leaf("r1"): Tree): Tree): Tree"""</span>)
</code></pre>
</div>
</div>
</div>
